Revit 2026 API

# ExportFontTableRemove Method

---

Removes the pair (key, info) by font key.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void Remove(
	ExportFontKey exportFontKey
)
```
```vb
Public Sub Remove (
	exportFontKey As ExportFontKey
)
```
```cpp
public:
void Remove(
	ExportFontKey^ exportFontKey
)
```
```fsharp
member Remove :
        exportFontKey : ExportFontKey -> unit
```

#### Parameters

exportFontKey ExportFontKey
     The export font key.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

ExportFontTable Class

Autodesk.Revit.DB Namespace